# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [124]:
# import libraries here
import pandas as pd
import numpy as np

# Challenge 1

#### Open the ` Employee.csv` file and name your dataset `employee`

In [125]:
# your answer here

employee = pd.read_csv('Employee.csv')
employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department. 
##### Tip : There are 2 ways to do it - one way is with and the other way is without pivot tables. Do it both ways.

In [126]:
# your answer here-1st way
employee.groupby('Department').mean()

               Years  Salary
Department
HR          4.666667   45.00
IT          4.500000   48.75
Sales       2.500000   55.00

In [127]:
# your answer here-2nd way
employee.pivot_table(index = ['Department'])

            Salary     Years
Department
HR           45.00  4.666667
IT           48.75  4.500000
Sales        55.00  2.500000

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title

In [128]:
# your answer here
employee.pivot_table(index = ['Department','Title'])

                      Salary  Years
Department Title
HR         VP           70.0    8.0
           analyst      32.5    3.0
IT         VP           70.0    8.0
           analyst      32.5    1.5
           associate    60.0    7.0
Sales      associate    55.0    2.5

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [129]:
# your answer here
employee.pivot_table(index = ['Department','Title','Salary'], columns = ['Years'],aggfunc='first')

                            Education                                   \
Years                               1         2       3         4    7
Department Title     Salary
HR         VP        70           NaN       NaN     NaN       NaN  NaN
           analyst   30           NaN    Master     NaN       NaN  NaN
                     35           NaN       NaN     NaN  Bachelor  NaN
IT         VP        70           NaN       NaN     NaN       NaN  NaN
           analyst   30           NaN    Master     NaN       NaN  NaN
                     35      Bachelor       NaN     NaN       NaN  NaN
           associate 60           NaN       NaN     NaN       NaN  Phd
Sales      associate 55           NaN  Bachelor  Master       NaN  NaN

                                    Gender                           Name  \
Years                             8      1    2    3    4    7    8     1
Department Title     Salary
HR         VP        70      Master    NaN  NaN  NaN  NaN  NaN    F   NaN
           analyst   30         NaN    NaN    M  NaN  NaN  NaN  NaN   NaN
                     35         NaN    NaN  NaN  NaN    F  NaN  NaN   NaN
IT         VP        70      Master    NaN  NaN  NaN  NaN  NaN    M   NaN
           analyst   30         NaN    NaN    F  NaN  NaN  NaN  NaN   NaN
                     35         NaN      M  NaN  NaN  NaN  NaN  NaN  Jose
           associate 60         NaN    NaN  NaN  NaN  NaN    M  NaN   NaN
Sales      associate 55         NaN    NaN    F    M  NaN  NaN  NaN   NaN


Years                            2       3      4      7       8
Department Title     Salary
HR         VP        70        NaN     NaN    NaN    NaN     Ana
           analyst   30      David     NaN    NaN    NaN     NaN
                     35        NaN     NaN  Sonia    NaN     NaN
IT         VP        70        NaN     NaN    NaN    NaN  Carlos
           analyst   30      Maria     NaN    NaN    NaN     NaN
                     35        NaN     NaN    NaN    NaN     NaN
           associate 60        NaN     NaN    NaN  Pedro     NaN
Sales      associate 55        Eva  Samuel    NaN    NaN     NaN

#### We want to know the information about the mean salary and number of employees in each department and for each job title

In [130]:
# your answer here
variable = employee.pivot_table(index=['Department','Title'], aggfunc={'Salary': np.mean,'Name': 'count'})
variable.columns = ['No Employees','Mean Salary']
variable

                      No Employees  Mean Salary
Department Title
HR         VP                    1         70.0
           analyst               2         32.5
IT         VP                    1         70.0
           analyst               2         32.5
           associate             1         60.0
Sales      associate             2         55.0

#### We want to know for each department and for each job title the Salary's median,minimum,maximum and standard deviation. Comment your results

In [131]:
# your answer here
employee.pivot_table(index = ['Department','Title'], aggfunc = [np.median,min,max,np.std], values = 'Salary', fill_value=0)

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN
Sales      associate   55.0     55     55  0.000000

#### Based on your comments, fill the missing values with an appropriate value

In [132]:
# your answer here
employee.pivot_table(index = ['Department','Title'], aggfunc = [np.median,min,max,np.std], values = 'Salary', fill_value=0)

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN
Sales      associate   55.0     55     55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [133]:
# your answer here
employee.pivot_table(index  = ['Department'], aggfunc = {'Salary': np.mean,'Name': 'count'}).rename(columns = {'Name' : 'Nº Empleados'})

            Nº Empleados  Salary
Department
HR                     3   45.00
IT                     4   48.75
Sales                  2   55.00

#### For each Department and Title, we want to know the the total years of work experience and the mean salary

In [134]:
# your answer here
employee.pivot_table(index = ['Department','Title'], aggfunc = {'Years': sum, 'Salary': np.mean})

                      Salary  Years
Department Title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7
Sales      associate    55.0      5

#### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table

#### * Hint: Write a custom function*

In [135]:
# your answer here--Your custom function here
def remove_max(df, column):
    x = df.grouby(column).max()

In [136]:

employee['Salary'].idxmax()

6

In [137]:
x = employee.pivot_table(index=["Department"], values=["Salary"],aggfunc=np.max)

In [138]:
employee.pivot_table(index = ['Department'])

            Salary     Years
Department
HR           45.00  4.666667
IT           48.75  4.500000
Sales        55.00  2.500000

In [139]:
x = []

x.append(employee.loc[employee['Department']=='IT']['Salary'].idxmax())
x.append(employee.loc[employee['Department']=='HR']['Salary'].idxmax())
x.append(employee.loc[employee['Department']=='Sales']['Salary'].idxmax())

x

[6, 8, 4]

In [141]:
employee.drop(employee.index[x], inplace=True)
employee

IndexError: index 6 is out of bounds for axis 0 with size 6

In [ ]:
employee['Department'].id

In [85]:
employee.groupby('Department')

In [95]:
employee.groupby(('Department').idxmax())

AttributeError: 'str' object has no attribute 'idxmax'

In [79]:
# your answer here
employee['Salary'].drop(x)

KeyError: '[70 70 55] not found in axis'

# Challenge 2

#### Open the ` Fitbit.csv` file and name your dataset `fitbit`

In [14]:
# your answer here

#### Explore you dataset in terms of data types and descriptive statistics
#### *Hint: Use Pandas functions from previous lectures*

In [15]:
# your answer here

In [16]:
# your answer here

#### You suspect that there must be a linear relationship between the Minutes Very Active and the Steps. Compute the correlation between these variables.

In [17]:
# your answer here

#### Use matplotlib to visually plot Minutes Very active vs Steps. 

##### Hint : import matplotlib.pyplot as plt (See previous lessons)#####
- Use plt.scatter(x=df['col_name_1'], y=df['col_name_2'])

In [18]:
# your answer here

#### What can you say about Minute Very Active and Steps? Write a comment below

In [19]:
# your comment here

#### We also suspect that there must be a linear relationship between the Minutes Sedentary and the Steps. Compute the correlation between these variables.

In [20]:
# your answer here

#### Use matplotlib to visually plot Minutes Sedentary vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [21]:
# your answer here

In [22]:
# Your comment here

#### We also suspect that there must be a linear relationship between the MinutesOfSleep and the Steps. Compute the correlation between these variables.

In [23]:
# your answer here

#### Use matplotlib to visually plot MinutesOfSleep vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [24]:
# your answer here

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`
column= ['Calorie burned', 'Steps','Floors','Minutes Sedentary','Minutes Very Active', 'MinutesOfSleep']

In [25]:
# your answer here

In [26]:
#Print cor_fit

#### Based on the result of the correlation matrix. What are the highly correlated features with the variable Steps?
*Hint: From the results above select the variable Steps and order your results in descending order (use Pandas sort_values function)*

In [27]:
# your answer here

# Challenge 3

#### Open the `Time_Grades.csv` file and name your dataset `time_grades`

In [28]:
# your answer here

In [29]:
#Print time_grades

#### Show visually the frequency distribution of the time_grades dataset.

In [30]:
# your answer here

#### Is there a correaltion between study time and Grade? Use both Pearson and Spearman correlation and comment your results.

In [31]:
# your answer here-Pearson

In [32]:
## your answer here-Spearman

#### Use matplotlib to visually plot Study time vs Grade. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [33]:
# your answer here

In [34]:
#your comment here

#### Could you explain the difference between Pearson and Spearman correlation? (see References in README.md)

In [35]:
#your comment here